{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "f18e17f5",
   "metadata": {},
   "source": [
    "### Лаба 4\n",
    "##### Иванов Андрей ИУ7-16Б\n",
    "##### Вариант 57\n",
    "---  \n",
    "Составить программу вычисления суммы ряда (по варианту) с точностью до члена\n",
    "ряда . Программа должна позволять задать значение аргумента (если требуется поε\n",
    "варианту), точность, максимальное количество итераций и шаг печати. Необходимо\n",
    "вывести таблицу промежуточных вычислений с заданным шагом (номер итерации,\n",
    "значение текущего члена, промежуточное значение суммы) и результат - вычисленное\n",
    "значение суммы ряда либо сообщение о том, что за указанное число итераций\n",
    "необходимой точности достичь не удалось.\n",
    "$$𝑦 = \\frac{1}{2^2} + \\frac{1}{5^2} + \\frac{1}{8^2} + … + \\frac{1}{(3n-1)^2} + … $$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "af5691ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "EPS = float(input('Введите точность расчетов: '))\n",
    "MAXITT = int(input('Введите максимальное количество иттераций: '))\n",
    "STEPOUTPUT = int(input('Введите шаг вывода: '))\n",
    "\n",
    "if EPS <= 0:\n",
    "    print('Точность должна быть положительна')\n",
    "else:\n",
    "    sumSequence = 0\n",
    "\n",
    "    # заголовок таблицы\n",
    "    print('-'*44, '\\n',\n",
    "        f\"|{'№ итерации':^10}|{'t':^15}|{'s':^15}|\", '\\n',\n",
    "        '-'*44, sep='')\n",
    "\n",
    "    for i in range(1, MAXITT + 1):\n",
    "        \n",
    "        currentValue = 1 / (3*i - 1)**2 # текущее значение\n",
    "        sumSequence += currentValue\n",
    "        \n",
    "        if (i - 1) % STEPOUTPUT == 0: # проверка на шаг печати\n",
    "            print(f'|{i:^10}|{currentValue:^15.7g}|{sumSequence:^15.7g}|')\n",
    "            \n",
    "        if abs(currentValue) <= EPS: # проверка на нужную точность\n",
    "            print('-'*44, '\\n',\n",
    "                f'Сумма бесконечного ряда - {sumSequence}, вычислена за {i} итерации.',\n",
    "                sep='')\n",
    "            break\n",
    "    else: # если не достигнуто за нужное количество иттераций\n",
    "        print('-'*44, '\\n'\n",
    "            'За указанное число итераций необходимой точности достичь не удалось.',\n",
    "            sep='')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
