{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "f18e17f5",
   "metadata": {},
   "source": [
    "### Лаба 4\n",
    "##### Иванов Андрей ИУ7-16Б\n",
    "##### Вариант 57\n",
    "---  \n",
    "Составить программу вычисления суммы ряда (по варианту) с точностью до члена\n",
    "ряда . Программа должна позволять задать значение аргумента (если требуется поε\n",
    "варианту), точность, максимальное количество итераций и шаг печати. Необходимо\n",
    "вывести таблицу промежуточных вычислений с заданным шагом (номер итерации,\n",
    "значение текущего члена, промежуточное значение суммы) и результат - вычисленное\n",
    "значение суммы ряда либо сообщение о том, что за указанное число итераций\n",
    "необходимой точности достичь не удалось.\n",
    "$$𝑦 = \\frac{1}{2^2} + \\frac{1}{5^2} + \\frac{1}{8^2} + … + \\frac{1}{(3n-1)^2} + … $$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "7343ab73",
   "metadata": {},
   "outputs": [],
   "source": [
    "EPS = float(input('Введите точность расчетов: '))\n",
    "MAXITT = int(input('Введите максимальное количество иттераций: '))\n",
    "STEPOUTPUT = int(input('Введите шаг вывода: '))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "af5691ee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--------------------------------------------\n",
      "|№ итерации|       t       |       s       |\n",
      "--------------------------------------------\n",
      "|    1     |     0.25      |     0.25      |\n",
      "|    6     |  0.003460208  |   0.3224517   |\n",
      "|    11    | 0.0009765625  |   0.330487    |\n",
      "|    16    | 0.0004526935  |   0.3335599   |\n",
      "|    21    | 0.0002601457  |   0.3351822   |\n",
      "|    26    | 0.0001686625  |   0.3361848   |\n",
      "|    31    | 0.0001181474  |   0.3368658   |\n",
      "|    36    | 8.734387e-05  |   0.3373586   |\n",
      "|    41    | 6.718624e-05  |   0.3377317   |\n",
      "|    46    | 5.327934e-05  |   0.338024    |\n",
      "|    51    | 4.328255e-05  |   0.3382591   |\n",
      "|    56    | 3.585643e-05  |   0.3384524   |\n",
      "|    61    | 3.018959e-05  |   0.3386141   |\n",
      "|    66    | 2.576722e-05  |   0.3387514   |\n",
      "|    71    | 2.224991e-05  |   0.3388693   |\n",
      "|    76    | 1.940655e-05  |   0.3389718   |\n",
      "|    81    | 1.707534e-05  |   0.3390617   |\n",
      "|    86    | 1.514027e-05  |   0.3391411   |\n",
      "|    91    | 1.351644e-05  |   0.3392118   |\n",
      "|    96    | 1.214049e-05  |   0.3392752   |\n",
      "--------------------------------------------\n",
      "За указанное число итераций необходимой точности достичь не удалось.\n"
     ]
    }
   ],
   "source": [
    "sumSequence = 0\n",
    "\n",
    "# заголовок таблицы\n",
    "print('-'*44, '\\n',\n",
    "      f\"|{'№ итерации':^10}|{'t':^15}|{'s':^15}|\", '\\n',\n",
    "     '-'*44, sep='')\n",
    "\n",
    "for i in range(1, MAXITT + 1):\n",
    "    \n",
    "    currentValue = 1 / (3*i - 1)**2 # текущее значение\n",
    "    sumSequence += currentValue\n",
    "    \n",
    "    if (i - 1) % STEPOUTPUT == 0: # проверка на шаг печати\n",
    "        print(f'|{i:^10}|{currentValue:^15.7g}|{sumSequence:^15.7g}|')\n",
    "        \n",
    "    if currentValue <= EPS: # проверка на нужную точность\n",
    "        print('-'*44, '\\n',\n",
    "              f'Сумма бесконечного ряда - {sumSequence}, вычислена за {i} итерации.',\n",
    "              sep='')\n",
    "        break\n",
    "else: # если не достигнуто за нужное количество иттераций\n",
    "    print('-'*44, '\\n'\n",
    "          'За указанное число итераций необходимой точности достичь не удалось.',\n",
    "          sep='')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.14.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
